declare var Tafgeet: any;

const getDayName = (date) => {
  var days = [
    "الاحد",
    "الاتنين",
    "الثلاثاء",
    "الاربعاء",
    "الخميس",
    "الجمعة",
    "السبت",
  ];
  var d = new Date(date.split("/").reverse().join("-"));
  return days[d.getDay()];
};

const getLeadsSection = (leads) => {
  return leads
    .map((lead) => {
      return `
      <p>
        <span class="fw-bold">السيـد:</span>
        ${lead.client_name_ar}
        <span class="fw-bold">الجنسيـة:</span>
        ${lead.client_nationality_ar}
        <span class="fw-bold">رقم قـومـي/ جواز سفر:</span>
        ${lead.client_nationality_id}
        <span class="fw-bold">والمقيـم في:</span>
        ${lead.client_address_ar}
        <span class="fw-bol">عنـوان المراسلـة:</span>
        ${lead.client_mailing_address_ar}
        <span class="fw-bold">البريد الإلكتروني:</span>
        ${lead.client_email}
        <span class="fw-bold">واتس اب:</span>
        ${lead.client_whatsapp}
        <span class="fw-bold">الهاتـف الأرضي - الهاتـف المحمول:</span>
        ${lead.client_phone}
        ${
          leads.length > 1
            ? `
          <span class="fw-bold">بنسبة:</span>
          ${lead.sharing_percentage}%
        `
            : ""
        }

      </p>
  `;
    })
    .join("");
};

const getPaymentTableRows = (payment_collections) => {
  return payment_collections
    .filter((payment) => payment.status !== "cancelled")
    .map((payment) => {
      return `
      <tr>
        <td>${payment.name}</td>
        <td>${payment.date}</td>
        <td>${payment.amount}</td>
      </tr>
  `;
    })
    .join("");
};

export const printContract = (
  { base, system },
  reservation,
  leads,
  payment_collections,
  customData
) => {
  // constants
  const project_type = {
    Commercial: "تجاري",
    Residential: "سكني",
    Administrative: "اداري",
    Hotel: "فندقي",
  };
  // prepare data
  console.log(reservation, leads, payment_collections);

  const getBankDetails = () => {
    let section = "";
    switch (system) {
      case "gud": {
        section = `
        <div class="section">
          <p class="fw-bold">بيانات التحويل البنكي:</p>
          <table class="table table-sm table-bordered text-center mb-0">
            <tr>
              <th class="">اسم المستفيد</th>
              <td>الجمهورية للإستثمار العقاري / Algomhorya For Real Estate</td>
            </tr>
            <tr>
              <th class="">رقم الحساب</th>
              <td>100050656262</td>
            </tr>
            <tr>
              <th class="">IBAN</th>
              <td>EG700010020700000100050656262</td>
            </tr>
            <tr>
              <th class="">اسم البنك</th>
              <td>
                البنك التجاري الدولي<br />
                Commercial International Bank (CIB)
              </td>
            </tr>
            <tr>
              <th class="">الفرع</th>
              <td>الرحاب - City Square - التجمع الأول</td>
            </tr>
            <tr>
              <th class="">كود تحويل الفرع IBAN / SWIFT CODE</th>
              <td>CIBEEGCX207</td>
            </tr>
            <tr>
              <th class="">سبب التحويل</th>
              <td>
              سداد مستحقات الوحدة رقم (${reservation.unit.serial}) مشروع رقم
              (${reservation.unit.project.name})
              </td>
            </tr>
          </table>
          <p>
            وفي كلا الحالتين يقـر الطـرف الثـانى أن نفـاذ عقـد البيـع معلـق علـى
            قيامـة بسـداد كامـل الـثمن ومبلـغ وديعـة الصـيانة الخـاص بالوحـدة
            وملحقاتهـا وأي التزامـات ماليـة أخـرى مستحقة للطرف الأول. ولا تبرأ ذمة
            الطرف الثاني الا بسداد الأقساط في المواعيد المحددة سلفا طبقا لملحق
            السداد
          </p>
        </div>
        `;
        break;
      }

      default: {
        section = `
        <div class="section">
          <p class="fw-bold">أرقام الحسابات البنكية:</p>
          <table class="table table-sm table-bordered text-center mb-0">
            <tr>
              <th class="">رقم الحساب</th>
              <th>IBAN</th>
              <th>العملة</th>
            </tr>
            <tr>
              <td>100035500736</td>
              <td>EG870010018500000100035500736</td>
              <td>جنيه مصري / Egyptian Pound (EGP)</td>
            </tr>
            <tr>
              <td>100052054243</td>
              <td>EG670010018500000100052054243</td>
              <td>دوالر أمريكي / ($) US Dollars</td>
            </tr>
            <tr>
              <td>100057802434</td>
              <td>EG740010018500000100057802434</td>
              <td>يورو / (£) Euro</td>
            </tr>
            <tr>
              <td>100057802388</td>
              <td>EG550010018500000100057802388</td>
              <td>ريال سعودي / Saudi Riyal (SAR)</td>
            </tr>
            <tr>
              <td>100057802407</td>
              <td>EG270010018500000100057802407</td>
              <td>درهم اماراتي / Emirati Dirhams (AED)</td>
            </tr>
          </table>
        </div>
        <div class="section">
          <p class="fw-bold">بيانات التحويل البنكي:</p>
          <table class="table table-sm table-bordered text-center mb-0">
            <tr>
              <th class="">اسم المستفيد</th>
              <td>منـشــأة جـبـــال / Jebal Institution</td>
            </tr>
            <tr>
              <th class="">اسم البنك</th>
              <td>
                البنك التجاري الدولي<br />
                Commercial International Bank (CIB)
              </td>
            </tr>
            <tr>
              <th class="">الفرع</th>
              <td>التجمع الأول - Way Water - القاهرة الجديدة – ج.م.ع</td>
            </tr>
            <tr>
              <th class="">كود تحويل الفرع IBAN / SWIFT CODE</th>
              <td>CIBEEGCX185</td>
            </tr>
            <tr>
              <th class="">سبب التحويل</th>
              <td>
              سداد مستحقات الوحدة رقم (${reservation.unit.serial}) مشروع رقم
              (${reservation.unit.project.name})
              </td>
            </tr>
          </table>
          <p>
            وفي كلا الحالتين يقـر الطـرف الثـانى أن نفـاذ عقـد البيـع معلـق علـى
            قيامـة بسـداد كامـل الـثمن ومبلـغ وديعـة الصـيانة الخـاص بالوحـدة
            وملحقاتهـا وأي التزامـات ماليـة أخـرى مستحقة للطرف الأول. ولا تبرأ ذمة
            الطرف الثاني الا بسداد الأقساط في المواعيد المحددة سلفا طبقا لملحق
            السداد
          </p>
        </div>
        `;
        break;
      }
    }
    return section;
  };

  const delegationSigner =
    leads.find(
      (lead) => lead.lead_id == customData.delegation_of_management_id
    ) || leads[0];

  return `<!DOCTYPE html>
  <html lang="ar" dir="rtl">
    <head>
      <meta charset="UTF-8" />
      <meta http-equiv="X-UA-Compatible" content="IE=edge" />
      <meta name="viewport" content="width=device-width, initial-scale=1.0" />
      <title>عقد</title>

      <link rel="stylesheet" href="${base}assets/css/vendor/bootstrap.rtl.min.css" />

      <style>
        @font-face {
          font-family: DroidArabicKufi;
          src: url(${base}assets/fonts/DroidArabicKufi.ttf);
        }

        body {
          font-size: 10pt;
          font-family: DroidArabicKufi;
        }

        // .bg-secondary {
        //   background-color: #bfbfbf !important;
        // }

        p {
          margin-bottom: 3pt;
        }

        .img-fluid-h {
          max-width: 100%;
          max-height: 100%;
        }

        .page {
          height: 100vh;
          max-width: 100%;
          background-image: url(${base}assets/img/letterhead.png);
          background-size: 100% 100%;
        }

        @media print {
          * {
            -webkit-print-color-adjust: exact;
            print-color-adjust: exact;
          }

          .page-break {
            page-break-inside: avoid;
            page-break-before: avoid;
            page-break-after: always;
          }

          .page {
            padding: 5.5rem 2rem 2rem;
          }

          // header {
          //   position: fixed;
          //   top: 0;
          //   left: 0;
          //   right: 0;
          //   height: 50px;
          // }

          // footer {
          //   position: fixed;
          //   bottom: 10px;
          //   left: 0;
          //   right: 0;
          // }
        }

        @page {
          size: A4 portrait;
        }

        .dotted {
          text-decoration: underline dotted;
        }

        .dotted-line {
          border-top: 3px dotted #000;
          height: 3px;
          width: 100%;
        }
        /* font-sizes */
        .header {
          font-size: 14pt !important;
          font-weight: bolder;
        }
        .sub-header {
          font-size: 11pt !important;
        }

        .lh-30 {
          line-height: 30px
        }
      </style>
    </head>
    <body class="bg-light">
      <div class="page page-break">
        <h1 class="text-center header">
          عقد بيع ابتدائي وحده ${reservation.unit.serial} (تحت الإنشاء)
          بالتقسيط
        </h1>
        <p class="text-center sub-header mb-3">
          (مع احتفاظ البائع بالملكية لحين سداد كامل الثمن)
        </p>

        <p class="mb-3">
          إنه في يوم ${getDayName(reservation.selling_date)} الموافق
          ${reservation.selling_date} م. قد تحرر هذا العقد بين كلاً من :
        </p>

        <div class="section">
          <p class="fw-bold">أولاً (الشركة المطورة) :</p>
          <p>
            <span class="fw-bold">شركة جبال للتطوير العقاري</span> ( ش.ذ.م.م ) -
            سجل تجاري رقم 100217 - صادر بتاريخ 2016/12/21 - استثمار القاهرة
          </p>
          <p>
            ويمثلها السيد/ أحمد محمد عطية السيد العتر - بصفته/ رئيس مجلس الإدارة
            وله حق التوقيع
          </p>
          <p>
            ومقرها/ مبنى اداري رقم 340 - الدور الأول - شارع التسعين الجنوبي -
            القطاع الثالث - التجمع الخامس - القاهرة الجديدة.
          </p>
          <div class="text-end fw-bold">طرف أول - بائع</div>
        </div>

        <div class="section">
          <p class="fw-bold">ثانياً :</p>
          ${getLeadsSection(leads)}
          <div class="text-end fw-bold">طرف ثاني - مشتري</div>
        </div>

        <p class="mb-3">
          وحيث أقر الطرفان بكامل أهليتهما للتصرف والتعاقد اتفقا على اﻵتي:
        </p>

        <p class="text-center sub-header fw-bold mb-3">تـمـــهـــيـــــد</p>

        <div class="section lh-30">
          <p>
            لما كانت شركة جبال للتطوير العقاري - قد تأسست طبقا لأحكام القانون
            المصري، وكان أحد أغراض الشركة هو التطوير والاستثمار العقاري وتنمية
            الأراضي بالبناء عليها وبيعها كوحدات سكنية وفيالت أو لأغراض مختلطة
            تجارية وادارية وفندقية وسياحية، وبموجب سجل تجاري رقم 100217 - استثمار
            القاهرة حيث يطور الطرف الاول ما هو قطعه الارض رقم
            ${reservation.unit.project.land_number} حرف ${
    reservation.unit.project.land_letter
  } بمنطقة
                      ${reservation.unit.project.region} حي ${
    reservation.unit.project.district
      ? reservation.unit.project.district.name
      : ""
  } بمدينة ${
    reservation.unit.project.district && reservation.unit.project.district.city
      ? reservation.unit.project.district.city.name
      : ""
  } ويتم انشاء العقار علي ذات القطعة موضوع
            العقد بمعرفة الطرف الأول بناء علي رخصة البناء التي تصدر من
            ${reservation.unit.project.license_issuer} وطبقا للرسومات
            المرفقة في العقد وحيث يرغب الطرف الثانى فى شراء وحدة فى المشروع المشار
            إليه وما يخصها من حصة باألرض والأجزاء المشتركة ولما كان للطرف الأول قد
            طرح بيع وحدات بالمشروع سالف الذكر والذى يتميز بطابع حضارى و معمارى
            متميز . ويشمل هذا العقد الأتفاق الكامل بين الطرفين بشأن مضمونه ويلغى
            ويحل محـل ايـة مفاوضـات شـفوية او تحريريـة سـابقة بـين الطـرفين و
            بنـاء عليـه فقـد تقـدم الطرف الثانى الى الطرف الأول وأبدى رغبته فى
            شراء إحدى الوحدات لاستخدامها فى غرض
            ${
              project_type[reservation.unit.project.type]
            } بالشروط الواردة بهذا العقد وحيث أقر
            الطرفان بكامل أهليتهما للتصرف والتعاقد وانهما غير خاضعين لأحكام
            الحراسة اتفقا علي االتي :
          </p>
        </div>
      </div>
      <div class="page page-break">
        <p class="text-center sub-header fw-bold mb-3">تعريفات العقد</p>
        <p>
          <span class="fw-bold">الطرف الأول: </span>ويعرف في هذا العقد بالطرف
          البائع وهو الطرف أيضا الذي يقوم بتطوير و إدارة المشروع بمعرفته أو تفويض
          إحدى الشركات المتخصصة في مجال الإنشاء وصيانة العقارات بإرادته المنفردة
          دون غيره من السادة المشترين لوحدات المشروع.
        </p>
        <p>
          <span class="fw-bold">الطرف الثاني: </span>ويعرف في هذا العقد بالطرف
          المشترى (المتعاقد) لأي عدد من وحدات المشروع.
        </p>
        <p>
          <span class="fw-bold">اسم المشروع [${
            reservation.unit.project.name
          }]: </span> ویقصد به المشروع
          المزمع إقامته من قبل الطرف الأول علي الأرض المذكورة بشروط هذا العقد .
        </p>
        <p>
          <span class="fw-bold">العقار: </span> هو المبنى الكائن به الوحدة في حالة
          إن كانت الوحدة جزء من عقار وليست منفصلة.
        </p>
        <p>
          <span class="fw-bold">الثمن: </span> ويقصد به سعر الوحدة وملحقاتها
          المبينة بشروط هذا العقد.
        </p>
        <p>
          <span class="fw-bold">الوحدة: </span> ويقصد بها الوحدة المبيعة مبينة
          الحدود والمعالم في شروط هذا العقد وملحقاته.
        </p>
        <p>
          <span class="fw-bold">الوحدة التجاریة: </span> ویقصد بھا الوحدة التي تقع
          في الأجزاء التجاریة والمخصصة للنشاط التجاري – ماكولات ومشروبات سريعه
          التحضير – صيدلية - او نشاط بيع بالتجزئة – وخلافه من الأنشطة التجارية
          المصرح بها بموافقة خطية من الطرف الأول فقط والذي لا یجوز بأي حال من
          الاحوال ومھما كانت الاسباب أن یتم تعدیله إلا بموافقة كتابیة صریحة من
          الطرف الأول وایضا المساحة الخارجیة الخاصة بالوحدة حق انتفاع فقط ولا یجوز
          البناء علیھا بأى حال من الاحوال. كما لا یسمح بوضع اى مظلات او اى انشاءات
          اخرى إلا بعد الحصول على موافقة كتابیة من الطرف الأول وبعد حصوله على رخصة
          للتشغیل خاصة بالوحدة وتشمل المساحة الخارجیة. ( إن وجدت )
        </p>
        <p>
          <span class="fw-bold">الوحدة الإدارية: </span> ويقصد يها الوحدة التى تقع
          فى الجزء الإدارى والمخصصة للغرض الإدارى فقط (ويشمل النشاط الطبي/عيادات)
          ولا يجوز بأى حال من الأحوال ومهما كانت الأسباب ان يتم تعديلها لأي غرض
          اخر غير الإداري إلا بعد موافقة كتابية صريحة من الطرف الأول وإستخراج
          التراخيص والموافقات الازمة لذلك .
        </p>
        <p>
          <span class="fw-bold">الوحدة الفندقية: </span> ويقصد يها الوحدة التى تقع
          فى الجزء الفندقي والمخصصة للغرض السكني فقط (إختيارية للمطور) لا يجوز بأى
          حال من الأحوال ومهما كانت الأسباب ان يتم تعديلها لأي غرض اخر غير السكني
          إلا بعد موافقة كتابية صريحة1.5 من الطرف الأول وإستخراج التراخيص والموافقات
          الازمة لذلك
        </p>
        <p>
          <span class="fw-bold">الحديقة: </span> هي مساحة تخصص بحق انتفاع لبعض
          نماذج الوحدات الكائنة بالدور الأرضي وهي مساحة مخصصة كحديقة دون ان يحق
          للطرف الثاني البناء عليها.
        </p>
        <p>
          <span class="fw-bold">الرووف: </span> هي مساحة بسطح العقار تخصص بحق
          انتفاع لبعض نماذج الوحدات الكائنة بالدور الأخير أو تباع منفصلة دون ان
          يحق له البناء عليها بدون الرجوع للطرف الأول وأخذ موافقة كتابية منه.
        </p>
        <p>
          <span class="fw-bold">البيزمنت: </span> هي مساحة بالبدروم بالعقار موضوع
          التعاقد تخصص مشاعا كملحق لبعض نماذج الوحدات الكائنة بالدور الأرضي وأيضا
          بها وحدات للجراج لبعض الوحدات المتعاقدة على وحدات جراج ركنات للسيارات.
        </p>
        <p>
          <span class="fw-bold">المساحة الخارجية (األوتدور) Outdoor : </span> وهي
          مساحة خارجية تخصص بحق انتفاع لبعض نماذج الوحدات الكائنة بالمشروعات
          المختلطة (تجاري/اداري/طبي) ويتحمل الطرف الثاني مصروفات ترخيصها وتشغيلها
          دون ان يحق للطرف الثاني البناء عليها أو استغلالها بنشاط غير المتفق عليه
          بدون الرجوع وأخذ موافقة كتابية من الطرف الأول.
        </p>
        <p>
          <span class="fw-bold">تاريخ التسليم الابتدائي: </span> التاريخ المبين
          بالعقد والمتوقع بحلوله قيام الطرف الأول بالانتهاء من بناء هيكل الوحدة
          ابتدائيا طبقا لملحق مواصفات التشطيب وتسليمه للطرف الثاني.
        </p>
        <p>
          <span class="fw-bold">تاريخ التسليم النهائي: </span> التاريخ المتوقع
          بحلوله قيام الطرف الأول بالانتهاء من المبنى كاملا طبقا لملحق مواصفات
          التشطيب بعد حوالي اثنى عشر شهرا من التسليم الإبتدائي وتسليمه للطرف
          الثاني.
        </p>
        <p>
          <span class="fw-bold">الأجزاء المشتركة: </span> ويقصـد بهـا جميـع
          الأجـزاء من المـداخل والمخـارج والبهـو الرئيسـي والمنـافع المشـتركة
          والطـرق والأرصـفة والأسـوار والبوابـة الرئيسية والداخلية وخطـوط البنيـة
          التحتيـة والمنـاطق الخدميـة والطرقـات الداخلية والشخشيخة ومناطق الخدمات
          بالبـدرومات والسـلالم والمصـاعد وهـي ملكيـة خالصـة للطـرف الأول ولـه
          فقـط دون غيـره سـواء كـان بمعرفتـه أو بواسـطة شـركة إدارة متخصصـة
          إدارتهـا أو اسـتغلالها، ولا يجـوز بـأي حـال مـن الأحـوال ضـم أي جـزء مـن
          الأجزاء إلى أي وحدة أو شغلها بـأي نـوع مـن أنـواع الإشـغالات. مـع ضـرورة
          الأخـذ فـي الإعتبـار أن حـق الدعاية والإعـالن وعوائـدها فـي كافـة
          الأمـاكن ذات الملكية الشائعة هو حق خالص للطرف الأول فقط.
        </p>
      </div>

      <div class="page page-break">
        <p class="text-center sub-header fw-bold mb-3">تابع: تعريفات العقد</p>
        <p>
          <span class="fw-bold">التسليم الفعلي: </span> هو تسليم الوحدة في الواقع
          من الطرف الأول إلي الطرف الثاني عن طريق محضر/اقرار تسليم أو جواب/إنذار
          تسليم
        </p>
        <p>
          <span class="fw-bold">التسليم الحكمي: </span> هى الحالة الموصوفة في بند
          التسليم
        </p>
        <p>
          <span class="fw-bold">التنازل: </span> تعني تنازل الطرف الثاني عن الوحدة
          بأية صورة من الصور ويشمل ذلك، علـي سـبيل المثـال لا الحصـر، البيـع أو
          البـدل أو الهبـة أو التبـرع أو الفسخ أو الحوالـة الى حق من الحقوق
          العينية المتعلقة بالوحدة.
        </p>
        <p>
          <span class="fw-bold">شركة الإدارة: </span> شركة إدارة وخدمات المشروع
          التى يسند اليها بمعرفة الطرف الأول وحده وفقا لأحكام قانون البناء رقم 119
          لسنة.
        </p>
        <p>
          <span class="fw-bold">الصیانة والأمن: </span> ویقصد بھا صیانة الممرات
          والواجھات والزراعات التجمیلیة والمصادر الرئیسیة للخدمات وبوجه عام
          الأجزاء المشتركة وكذا الحراسة العامة والكاميرات والعمالة والنظافة
          للمشروع
        </p>
        <p>
          <span class="fw-bold">وديعة الصيانة: </span> هو المبلغ المبين بشروط هذا
          العقد والذى يلتزم الطرف الثاني بسداده طبقا لشـروط وأحكـام هـذا العقـد
          علـي النحـو المبـين بالبنـد السادس مـن الشـروط الخاصـة طبقا من هذا العقد
          التى يتم تحصيلها من جميع مشترى وحدات المشروع وإيداعها لدي الطرف الأول
          فـي حسـاب الصـيانة المخصـص لـذلك بواقع عائد سنوي بعد تشغيل المشروع
          والتـى يقـوم الطـرف الأول بالإنفاق من عائدها علي صيانة وادارة ونظافة
          وتقديم الخدمات للمشروع. حیث أن الطرف الأول أو من یفوضه ھو الذي یتولى
          التعاقد مع إحدى الشركات المتخصصة في مجال صیانة وادارة الأصول ویعتبر
          توقیع الطرف الثاني على ھذا العقد إقرار و قبولا منه غیر مشروط و غیر قابل
          للرجوع فیه بالموافقة على ھذا مما یترتب علیه بالتزام الطرف الثاني بدفع
          نصیبة في المبالغ المستحقة عن الخدمات و الصیانة للمشروع كودیعة وذلك
          لألنفاق من عائدھا على صیانة المشروع وأمنه ومسطحاته الخضراء وتطویره متى
          لزم الأمر ویجوز للطرف الأول الرجوع على الطرف الثاني في أي وقت بشأن فروق
          الأسعار وما یطرأ علیھا من زیادات إذا لم تستوعب عوائد الودیعة كامل
          النفقات .وذلك بعد اعداد الميزانية واعتمادها من مراجع الحسابات .
        </p>
        <p>
          <span class="fw-bold">الإخلال ببنود العقد: </span> ويقصـد بهـا الإخلال
          ببنـود هـذا العقـد فـي أي مرحلـة وأي وقـت دون تحديـد سـقف زمنـي حتـى
          ولـو تـم الإخلال بعـد إشـهار العقـد وتسـجيله إذ العبـرة بالعالقـة
          التعاقدية وقواعد وضوابط العقد فيما بين الطرف الأول والطرف الثاني
        </p>
        <p>
          <span class="fw-bold">اللافتات وأماكنھا: </span> ویقصد بھا الأماكن
          المحددة من قبل الطرف الأول لالفتـــات وھى أمـاكـن محددة على وجه الدقة
          ووفقا للشكل المعماري للمشروع ولا یجوز بأي حال من الأحوال للطرف الثاني
          تعدیلھا أو تغیرھا أو استبدال أماكنھا أو الجور على مساحة الغیر حتى لو ظلت
          ھناك مساحات خالیة ولا یتم وضع اللافتات وتركیبھا إلا بعد اعتمادھا من
          الطرف الأول بموافقة خطية من حیث التصمیم والشكل الذي یتناسب و یتوائم مع
          طبیعة المشروع والشكل المعماري واللمسة الجمالیة كما لا یجوز للطرف الثاني
          بأي حال من الأحوال تعدیل ھذا التصمیم إلا بموافقة كتابیة مسبقة من الطرف
          الأول وفى حالة إخلال الطرف الثاني بذلك فإنه یكون قد أخل بشرط من شروط
          التعاقد التي يحق بھا للطرف الأول سواء قبل أو بعد التسجیل كما ھو منصوص
          علیه بفقرة التعریفات ازالة المخالفة سبب الاخلال على نفقة الطرف الثاني
          دون الحق فى الاعتراض
        </p>
        <p>
          <span class="fw-bold">القوة القاهرة : </span> وتعني كل حدث أو أحداث ذات
          طابع عام بغض النظر عن وقت حدوثه أو المدة التى تستغرقها، تخرج عن إرادة
          الطرف الأول وتقدر بمعرفة الطرف الأول وتؤدي نتيجتها إعاقة الطـرف الأول عن
          تنفيذ أى من التزاماته التعاقدية ويحق له بناء عليها تعديل مساجة الوحدة
          بعد الترخيص أو موعد الإستالم أو انهاء التعاقد ورد مدفوعات الطرف الثاني
          كاملة دون تطبيق أية غرامات ومن ذلك علي سبيل المثال لا الحصر: الكوارث
          الطبيعية كالزالزل والبراكين والحرائق وحالات الحرب وكل فعل أو قرار
          والإضرابات العامة ً من أفعال أو القرارت السيادية من تأميم أو مصادرة أو
          وقف أعمال وما شابه ذلك، والتضخم وتعويم العملة وزيادة أسعار الخامات
          والعصيان المدنى والثورات، واجراءات التراخيص مع مراعاة احكام المادة 2/147
          من القانون المدني
        </p>
        <p>
          <span class="fw-bold"
            >مصادر میاه الشرب والصرف ومصادر الكھرباء وإطفاء الحریق:
          </span>
          ویقصد بھا المصادر الرئیسیة التي یوفرھا الطرف الأول للطرف الثاني وھذه
          المصادر یقـوم الطــرف الثـاني كــل حـســـب طبیعـــة نـــشاطـــه باستكمال
          أعمال التشطیبات الداخلیة بعــد اعتــماد الرسومـــات والمواصفـات
          الداخلــیة من الـــطــرف الأول حفاظا على سالمة المباني والمنشآت والشكل
          العام للمركز ولا یجوز للطرف الثاني بأي حال من الأحـوال ومھما كانت
          الأسباب أن یستحدث أي نوع من ھذه المصادر أو یقوم بتجزئتھا أو یقوم بمد
          وحدات أخرى بوصالت منھا.
        </p>
        <p>
          <span class="fw-bold">الفهرس والعناوين: </span> كل من الفهرس وعناوين
          البنود في هذا الإتفاق لإلسترشاد فقط ولن تؤخذ في الإعتبار عند التفسير
        </p>
        <p>
          <span class="fw-bold">المالحق: </span> وتعنى المالحق المرفقة بالعقد
          والموقعة من الطرفين كجزء لا يتجزأ منه والموضحة بالبند العشرون من هذا
          العقد.
        </p>
      </div>

      <div class="page page-break">
        <p>
          بعـد أن أقـر الطـرفين بكامـل أهليتهمـا القانونية للتعاقـد بناء علـي
          التمهيـد السـابق وتفهـم كافـة التعريفـات سـالفـة البيان، وكـذا شـروط و
          أحكـام هـذا العقـد و المالحق المرفقة والتى تعتبر جميعها جزء لا يتجزأ من
          هذا العقد ، اتفق الطرفان علي ما يأتى :
        </p>
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البنـــــــــد الأول - </span> التعريفات
            والتمهيد
          </p>
          <p>
            تعتبر التعريفات السالفة و التمهيد السالف جزء لا يتجزأ من هذا العقد
            وتعتبر ملزمه ومتممـة ومكملـه ومفسـره لـه موضـحه لكافـة بنـوده التـي
            تحكـم العالقـة بـين الطرفين.
          </p>
        </div>

        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البنــــــد الثاني - </span> موضوع العقد
          </p>
          <p>
            باع وأسقط وتنازل بكافة الضمانات الفعلية والقانونية الطرف الأول إلى
            الطرف الثاني القابل لذلك بموجب هـذا العقـد بيعـا بالتقسـيط موقوفـا
            علـى سـداد كامـل الثمن ما هو الوحدة رقـم ${reservation.unit.serial}
            الـدور ${reservation.unit.floor_number} بالعقار رقـم
            ${
              reservation.unit.building_num
            } طبقـا للمسـقط الأفقـي ملحـق رقـم (3)
            وطبقــا لمواصــفات التشــطيب المحــددة بــالملحق رقــم (4) والبــالغ
            إجمــالي مســاحتها ${reservation.unit.build_area} م<sup>2</sup> (فقط
            ${new Tafgeet(reservation.unit.build_area, "").parse(
              false
            )} متر مربع) تحت العجز والزيادة والعبرة
            بالمساحة الفعلية عند التسليم وبما يحدده كشف التحديد المعد بمعرفة هيئة
            المساحة و طبقا للوحات المرفقة وذلك بغرض استغلالھا في نـــشــاط
            ${
              project_type[reservation.unit.project.type]
            } ولا یجوز للمشترى تعدیل ھذا النشاط أو
            تغییره بأي حال من الاحوال إلا بعد الحصول على موافقة كتابیة صریحة من
            الطرف الأول وقد اتفق الطرفان على أن البيع موضوع هذا العقد يشمل مساحة
            الوحدة بالإضافة الى:
          </p>
          <p>
            <span class="fw-bold">-</span> حصه شائعة فى الأرض المقام عليها العقار
            الكائن به الوحدة موضوع هذا العقد تعادل نسبة مساحة الوحدة إلى باقي
            الوحدات بالمبنى شيوعا دون أرض باقي المشروع من حدائق وأماكن خدمات
            ومساحات خارجیة ومرافق والمملوكة للطرف الأول (البائع) ومن المتفق علیه
            بین أطراف العقد أنه توجد أجزاء تخرج عن مجال المنافع المشتركة فهى ملك
            للطرف الأول وحده مع حفظ حق الطرف الأول بحصه شائعة فى الأرض وللطرف
            المنتفع بها حق ادارتها والانتفاع بها وحده ولا تكون محال لھذا العقد وھي
            ملك الطرف الأول فقط وله الحق في استغلالھا كیفما یشاء دون اعتراض من
            مالك الوحدات الأخرى وھي:
          </p>
          <ul>
            <li>حق استعمال واستغلال الواجھات الصماء أو الزجاجية للمبنى</li>
            <li>المساحات المخصصة إلنتفاع وحدات الدور الأرضى كالحديقة</li>
            <li>
              البدرومات والجراج (إلا في حالة شراء الطرف الثاني مكان سیارة بالجراج
              وقیامه بسداد القیمة كاملة)
            </li>
            <li>السطح العلوي للمبنى وحق استعماله أو التصرف فیه أو العلو فوقه</li>
            <li>
              الأجزاء المشتركة والممرات والمداخل والسلالم والأماكن والممرات
              الخارجیة واللاند سكیب.
            </li>
          </ul>
          ${
            reservation.unit.basement_area
              ? `
          <p>
            <span class="fw-bold">-</span> ملحق بابدروم (البيزمنت) طبقاً للمسقط الأفقي ملحق رقم (3) وطبقاً لمواصفات التشطيب
            المحددة بالملحق رقم (4) والبالغ إجمالي مساحة الملحق
            ${reservation.unit.basement_area} م<sup>2</sup> (فقط
            ${new Tafgeet(reservation.unit.basement_area, "").parse(
              false
            )} متر مربع) وينم تقسيمة والحاقة بالوحدة
            طبقاً للملحق (فيما عدا السلم الداخلي - ان وجد - ) بعد التسليم بحد أقصى
            ستة أشهر من تاريخ عمل المطابقة الهندسية والفنية والموافقة عليها
            بالجهاز المختص واستالم مقايسة عدادات الكهرباء وتركيب العدادات للوحدات
            السكنية وسداد الطرف الثاني لمستحقاتها للطرف الأول.
          </p>
          `
              : ""
          }
          ${
            reservation.unit.roof_area
              ? `
          <p>
            <span class="fw-bold">-</span> ملحق بالسطح
            (الرووف) طبقاً للمسقط الأفقي ملحق رقم (3) وطبقاً لمواصفات التشطيب
            المحددة بالملحق رقم (4) والبالغ إجمالي مساحة الملحق
            ${reservation.unit.roof_area} م<sup>2</sup> (فقط
            ${new Tafgeet(reservation.unit.roof_area, "").parse(
              false
            )} متر مربع) وينم تقسيمة والحاقة بالوحدة
            طبقاً للملحق (فيما عدا السلم الداخلي - ان وجد - ) بعد التسليم بحد أقصى
            ستة أشهر من تاريخ عمل المطابقة الهندسية والفنية والموافقة عليها
            بالجهاز المختص واستالم مقايسة عدادات الكهرباء وتركيب العدادات للوحدات
            السكنية وسداد الطرف الثاني لمستحقاتها للطرف الأول.
          </p>
          `
              : ""
          }

          ${
            reservation.unit.outdoor_area
              ? `
          <p>
            <span class="fw-bold">-</span>حق الإنتفاع بمساحة خارجية (Outdoor
            )والملحقة بالوحدة المبيعة والبالغ إجمالي مساحتها
            ${reservation.unit.outdoor_area} م<sup>2</sup> فقط
            ${new Tafgeet(reservation.unit.outdoor_area, "").parse(
              false
            )}مترا مربعا مع إعتبار حق الإنتفاع المذكور
            جزء لا يتجزأ من الوحدة موضوع هذا العقد فلا يجوز التصرف فيه على استقلال
            كما يحظر على الطرف الثانى اقتطـاع اى جـزء مـن هذه المساحة وضمها الى
            الوحدة المبيعة او اقامة اية انشاءات عليها او على جزء منها او اجراء اية
            تعديلات بها ويتم الحاقها بالوحدة طبقا للملحق بعد التسليم بحد أقصى ستة
            أشهر من تاريخ عمل المطابقة الهندسية والفنية والموافقة عليها بالجهاز
            المختص واستلام مقايسة عدادات الكهرباء وتركيب العدادات للوحدات واصدار
            رخصة التشغيل للوحدات المختلطة.
          </p>
          `
              : ""
          }

          ${
            reservation.slots || reservation.storage_slots
              ? `
          <p>
            <span class="fw-bold">-</span> حق الإنتفاع بعدد
            ${+reservation.slots + +reservation.storage_slots} ${
                  reservation.slots
                    ? "مكان إنتظار سيارة رقم " + customData.parking_numbers
                    : ""
                } ${
                  reservation.storage_slots
                    ? "مخزن رقم " + customData.storage_numbers
                    : ""
                } والمخصص بالجراج الكائن ببدروم العقار
            الكائن به الوحدة المبيعـة، ويعتبر مكان الإنتظار المذكور جزء لا يتجزأ
            من الوحدة موضـوع هـذا العقـد و مـرتبط بملكيتهـا فلا يجـوز التصـرف فيـه
            علـى اسـتقلال كمـا يحظـر على الطرف الثانى اقتطاع اى جزء من هذه المساحة
            وضمها الى الوحدة المبيعة او اقامة اية انشاءات عليها او على جزء منها
            او اجراء اية تعديالت بها.
          </p>
          `
              : ""
          }

          ${
            reservation.unit.garden_area
              ? `
          <p>
            <span class="fw-bold">-</span> حق الإنتفاع بالحديقة والملحقة
            بالوحدة المبيعة والبالغ مساحتها ${
              reservation.unit.garden_area
            } م<sup
              >2</sup
            >
            فقط ${new Tafgeet(reservation.unit.garden_area, "").parse(
              false
            )} مترا مربعا مع إعتبار حق الإنتفاع
            المذكور جزء لا يتجزأ من الوحدة موضوع هذا العقد فلا يجوز التصرف فيه على
            استقلال كما يحظر على الطرف الثانى اقتطـاع اى جـزءمـن هذه المساحة وضمها
            الى الوحدة المبيعة اواقامة اية انشاءات عليها او على جزء منها اواجراء
            اية تعديالت بها ويسرى على حق الإنتفاع المذكور أعلاه كافة
            التزامات الطرف الثانى المنصوص عليها فى هذا العقد وخاصة الالتزامات
            المتعلقـة بسـداد الأقسـاط والمعاينة والإنتفاع والإستالم، وقد اتفق
            الطرفان على سريان حق الإنتفاع المشار اليهما بهذا البنـد فـى حـق الخلـف
            العـام والخلـف الخـاص للطـرف الثـانى .ويشار فيما بعد الى حق الإنتفاع
            الوارد أعلاه من هذا البند بـ "ملحقات الوحدة المبيعة " ويقر
            الطرف الثاني ويقبل بصفة نهائية بأن يقتصر انتفاعة بالوحدة المبيعه دون
            ملحقاتها علـى الغـرض الـذى خصصـت مـن أجلـه ولا يجـوز لـه أو لخلفـة
            العـام أو الخـاص تغييـر هـذا الغـرض واسـتغلالها كليـا أو جزئيـا فـى
            مباشـرة اى نشـاط آخر ويعتبـر الإخلال بهذا الإلتزام اخالال جوهريا
            بالعقد ويعتبر العقد مفسوخا من تلقاء نفسه دون حاجه الى تنبيه او انذار
            او صدور حكم قضائى بالفسخ .
          </p>
          `
              : ""
          }

          <p>
            ويسرى على حق الإنتفاع المذكور أعلاه كافة التزامات الطرف الثانى المنصوص
            عليها فى هذا العقد وخاصة الالتزامات المتعلقـة بسـداد الأقسـاط
            والمعاينة والإنتفاع والإستلام ومصروفاتهم، وقد اتفق الطرفان على سريان
            حق الإنتفاع المشار اليهما بهذا البنـد فـى حـق الخلـف العـام والخلـف
            الخـاص للطـرف الثـانى .ويشار فيما بعد الى حق الإنتفاع الوارد أعلاه من
            هذا البند بـ "ملحقات الوحدة المبيعة " ويقر الطرف الثاني ويقبل بصفة
            نهائية بأن يقتصر انتفاعة بالوحدة المبيعه دون ملحقاتها علـى الغـرض
            الـذى خصصـت مـن أجلـه ولا يجـوز لـه أو لخلفـة العـام أو الخـاص تغييـر
            هـذا الغـرض واسـتغلالها كليـا أو جزئيـا فـى مباشـرة اى نشـاط آخر
            ويعتبـر الإخلال بهذا الإلتتزام اخلالا جوهريا بالعقد ويعتبر العقد
            مفسوخا من تلقاء نفسه دون حاجه الى تنبيه او انذار او صدور حكم قضائى
            بالفسخ.
          </p>
        </div>
      </div>

      <div class="page page-break">
        <div class="section">
          <p class="text-center">
            <span class="fw-bold">البند الثالث - </span> الثمن وطريقة السداد
          </p>

          <p>
            تم هذا البيع وقبل من الطرفين نظير ثمـن اجمالى وقـدره
            ${reservation.total_price} ج.م (فقط
            ${new Tafgeet(reservation.total_price, "").parse(
              false
            )} ج. م لا غير) للوحدة المبيعة و ملحقاتها
            -إن وجد. (لا يشمل الضرائب اي كان نوعها ولا يشمل وديعة الصيانة) وقد تم
            الاتفاق بين أطراف هذا العقد علي ان تكون الدفعة المقدمة (دفعة مقدم
            التعاقد) عند تحرير هذا العقد مبلغا وقـدره
            ${reservation.total_down_payment} ج.م (فقط
            ${new Tafgeet(reservation.total_down_payment, "").parse(
              false
            )} جنيها مصريا لا غير) ويقر الطرف الثانى
            بأنه فى حالة عـدم قيامـه بسداد هذا المبلغ للطرف الأول بموجب ايصال
            مختوم بختمه أو إرتداد الشيك الخاص بالمبلغ المعجل (دفعة التعاقد) وعـدم
            صـرفه ألى سـبب كـان، يعتبـر هذا العقد مفسوخا من تلقاء نفسه دون الحاجة
            الى تنبيه أو إنذار أو إعذار أو أى حكم قضائى مع حـق الطـرف الأول
            التصـرف فـى الوحـدة محـل هـذا العقـد وطلب التعويضات اللازمة لذلك فورا
            دون الرجوع للطرف الثانى. ويقر الطرف الثاني بان ثمن الوحدة المباعة ال
            يتضمن عمل التعديالت والتشطيبات الداخلية للوحدة التي قد يطلبها من الطرف
            الأول، أمـا بـاقى الـثمن والبـالغ وقـدره
            ${reservation.total_price - reservation.total_down_payment} ج.م (فقط
            ${new Tafgeet(
              reservation.total_price - reservation.total_down_payment,
              ""
            ).parse(false)} جنيها مصريا لا غير) فقـد التـزم الطـرف
            الثـانى بسـداده للطـرف الأول علـى أقساط تسدد كاﻵتي:
          </p>

          <p class="fw-bold">
            1 - اذا كان الطرف الثاني مقيم داخل جمهورية مصر العربية:
          </p>
          <p>
            تم هذا البييقر الطرف الثاني بسداد باقي ثمن الوحدة بموجب شيكات بنكيه
            تستحق الدفع بمجرد حلول اﻵجال الواردة قرين كل منهما على النحو الموضـح
            تفصـيال بـالملحق رقـم (1) المرفـق بهذ العقد كما اتفق الطرف الأول
            البائع على أن تصدر شيكات الدفعة المقدم و شيكات أقساط باقى الثمن بإسم
            ولصالح الشركة أولا (الطرف الأول) ويقر الطرف الثاني بعلمه وموافقته على
            ذلك
          </p>

          <p class="fw-bold">
            2 - اذا كان الطرف الثاني مقيم خارج البالد/ خارج جمهورية مصر العربية:
          </p>
          <p>
            من المتفق عليه أنه في حالة إقامة الطرف الثاني خارج البالد فإن الطرف
            الثاني يتعهد باعطاء الطرف الأول ما يفيد اقامته بالخارج كما يقر الطرف
            الثاني بسداد باقي ثمن الوحدة بموجب اقرار تحويل بنكي وفي صورة تحويالت
            بنكية الي من أرقام حسابات الشركة الموضحة بالجدول أدناه وعلى النحو
            الموضـح تفصـيال بـالملحق رقـم (1) المرفـق بهذ العقد ويتم حساب سعر فرق
            العملة طبقا لسعر الصرف المعلن للبنك المحول له أو البنك المركزي ايهما
            اعلى يوم وصول التحويل بالحساب وبحد أقصى خلال أسبوع من تاريخ التحويل،
            ويعتبر ايصال التحويل بمثابة ايصال سداد لدفعة القسط طالما تم التحويل في
            الموعد المحدد واتفق الطرفان ان الأيداع أو التحويل بعد موعد استحقاق
            القسط يسري في حقة البند السابع من بنود هذا العقد وحينها لا تبرأ ذمة
            المشتري الا بموجب ايصال سداد مختوم وموقع من الطرف الأول.
          </p>
        </div>
        ${getBankDetails()}
      </div>
      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند الرابع – </span> المعاينة
          </p>
          <p>
            يقر الطرف الثاني أنه اطلع علـى الرسومــــات الهندســـية بالنسـبة
            للوحـدة المباعـة وعلـى الطبيعـة بالنسـبة لألرض المقــــام عليهـا
            المشـروع ويقـر أنـه قبلهـا علـى حالتها بعد معاينتها المعاينة التامة
            النافية للجهالة وأنه أحاط بكل ما يتعلق بها من قوانين ولوائح متعلقة
            بالمشروع كما يقر أنه اطلع على كافة المستندات الخاصة بالمشروع والوحدة
            المتعاقد عليها ودرسها تفصيلا قبل التعاقد والشراء في ضوء ذلك كله.
          </p>
        </div>

        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند الخامس – </span> التسليم والشرط الجزائي
          </p>
          <p>
            يتعهد الطرف الأول أن يكون تنفيذ الوحدة المبيعة موضوع هذا العقد وفقا
            لألصول الفنية والهندسية ويضمن الطرف الأول سالمة المباني المقامة طبقا
            لكود البناء المصري الحديث. ويحق للطرف الثاني تعديل تقسيمة الوحدة بحد
            أقصى شهر من تاريخ الأستالم الأولي على نفقته الخاصة وبما لا يخالف أو
            يخل برخصة المباني وأماكن الصرف والتغذية والشبابيك والبلكونات المحددة
            من الطرف الأول.
          </p>
          <p>
            من المتفق عليه أن الموعد المتوقع مبدئيا لتسليم الوحدة ابتدائيا للمشتري
            بتاريخ تسليم ابتدائي ${customData.initial_delivery_date} م وبتاريخ
            استالم نهائي ${customData.final_delivery_date} م ويحتفظ الطرف الأول
            بحق مد تاريخ التسليم النهائي لمـدة اثنـي عشر شهرا من تاريخ التسليم
            المحدد. ويـتم إخطـار الطـرف الثـاني بخطـاب مسـجل بعلـم الوصـول يحـدد
            فيـه اليـوم المعـين إلسـتالم الوحـدة الـذي يتعـين عليـة الحضور شخصيا
            او من يمثله قانونا لإلسـتالم. ويلتزم الطرف الثاني باستالم الوحدة محل
            هذا العقد في الموعد المحدد، ويلتزم عند حضوره إلستالم الوحدة المباعة:
          </p>
          <ul>
            <li>
              سداده كافة الأقساط والدفعات واي التزامات مالية أخرى واجبة السداد حتى
              هذا التاريخ
            </li>
            <li>
              سداد نصيب الوحدة في مقايسة الكهرباء والمياة والغاز وخطوط الخدمات
              التكنولوجية والتأمينات الأجتماعية والعدادات الخاصة بالوحدة والمصعد
              فيما يخص نصيب الوحدة المتعاقد عليها والتي يقررها الطرف الأول وقت
              التسليم .
            </li>
          </ul>
          <p>
            وإذا لم يتقدم الطرف الثاني لإلستالم أو فى حالة تقاعس المشترى عن
            الأستالم بالموعد المحدد للتسليم في خلال 15 يوم مـن الموعـد المحـدد
            يعتبـر التسـليم قـد تـم فعليـا (حكميـا) وذلك عمال بالمادة (1/435) من
            القانون المدنى ، ويتحمـل الطـرف الثـاني كافـة الألتزامـات الماليـة
            الناشـئة عـن التسـليم الفعلـي بمـا فـي ذلـك نصـيب الوحـدة مـن مقايسـة
            الشـبكات و وديعـة الصـيانة والضـرائب والرسـوم الحكوميـة علـى الوحـدة
            المبيعـة و تنتفـي مسؤولية الطرف الأول عن اي تعويض مادي او تلفيات تحدث
            للوحدة المباعة مـن تـاريخ تسـليمها للطـرف الثـاني فعـال او حكمـا
            ويسـقط حـق الطـرف الثـاني فـي أي ادعـاء يمـس المواصـفات والاشـتراطات
            المتعاقـد عليهـا للوحـدة المباعـة سـالفة الـذكر مـن تـاريخ التسـليم
            فعـال او حكمـا مـن الطـرف الثـاني. و يـتم إحتساب غرامة تاخير إستالم
            بواقع %1 شهريا من إجمالي ثمن الوحدة. من المتفق عليه بين الطرفين انه في
            حالة تأخر الطرف الأول عن التسليم بعد مهلة الأثنى عشر شهرا بعد موعد
            الاستالم النهائي يستحق للطرف الثاني غرامة تـأخير بواقـع اربعـة مـن
            عشرة بالمائة %0.4 .من قيمة المبالغ المسددة من ثمن الوحدة عن كل شهر
            تأخير و حد أقصى ما يعادل نسبة خمسة بالمائة %5 من قيمة المبالغ المسددة
            بالفعل من ثمن الشراء وذلك كتعـويض إتفـاقي عـن الأضـرار التـي تلحـق
            بـالطرف الثـاني مـن جـراء التـأخير فـي التسـليم و يقر الطرف الثاني أن
            هذا التعويض لا يسري في الحالات اﻵتية:
          </p>
          <ul>
            <li>
              اذا كان التأخير في التسليم راجعا ألسباب لا دخل إلرادة الطرف الأول
              فيها أو بسبب قوة قاهرة أو بسبب تأخر السلطات المختصة في إصدار
              الموافقات اللازمة.
            </li>
            <li>
              تأخر الطرف الثاني في سداد أى قسط من الأقساط المستحقة للبائع ويكون
              التأخير في هذه الحالة بمقدار تأخر الطرف الثاني في سداد أى قسط من
              الأقساط المستحقة بما في ذلك مصاريف الصيانة والترفيق ويحق للطرف الأول
              الأمتناع عن التسليم حتى سداد كافة المستحقات والغرامات والمصروفات
              المستحقة على الوحدة حتى تاريخه.
            </li>
            <li>
              إذا كان التأخير في التسليم يرجع إلي رغبة الطرف الثاني في إجراء أعمال
              تعديالت أو ديكورات أو تشطيبات مغايرة أو إضافية بالوحدة المبيعة له أو
              ملحقاتها، إذ في هذه الحالة يتم تأجيل تاريخ التسليم ويكون تاريخ
              التسليم هو التاريخ الذى يتراضي عليه الطرفان عند توقيع الطرف الثانى
              علي الأستمارة الخاصة بأعمال التعديالت أو التشطيبات الجديدة
            </li>
            <li>
              إذا كان التأخير ناتج عن تأخر الجهات الحكومية أو غير الحكومية في
              إدخال خدمات المرافق إلى أرض المشروع مثل المياه والكهرباء والصرف
              الصحي.
            </li>
          </ul>
        </div>
      </div>

      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند السادس – </span> الصيانة والوديعة وإدارة
            المشروع
          </p>
          <p>
            يعتبـر توقيـع الطـرف الثـاني علـى هـذا العقـد إقـرارا وقبـولا منـه
            غيـر مشـروط وغيـر قابـل للرجـوع فيـه بالموافقـة علـى تـولي الطـرف
            الأول او مـن يفوضـه مهمـة الأدارة والأشـراف علـي الخـدمات العامـة
            والحـدائق والمرافـق داخـل المشـروع والمخصصـة للمنفعـة العامـة وتنفيـذ
            أعمـال الصـيانة، والتـى تشـمل كافـة المرافـق والشبكات والحدائق
            والنظافة وخدمات الأمن والحراسة وجمع القمامة وكل ما مـن شـأنه المحافظـة
            علـي اسـتمرار الأتفـاع بالمنـافع العامـة والخـدمات العامـة المخصصـة
            للمشـروع علـي الوجـه الأكمـل.والألتزام بالتعليمـات واللـوائح التـي مـن
            شـانها تيسـير مهمـة الطـرف الأول فـي إدارة المشـروع ولـذا فقـد اتفـق
            الطرفان على اﻵتي:
          </p>
          <ul>
            <li>
              يلتزم الطرف الثاني بان يسدد للطرف الأول مبلغ
              ${reservation.unit_maintenance_price} جنيه مصري (فقط
              ${new Tafgeet(reservation.unit_maintenance_price, "").parse(
                false
              )} جنيه مصري لا غير ) من القيمة
              الأجمالية للوحدة (كوديعه صيانه) تسدد علي دفعه واحدة بموجب شيك بنكي
              مسطر وتسلم للطرف الأول عند التعاقد وطبقا لجدول السداد المنصوص عليه
              بالملحق رقم (1) المرفق بهذا العقد و يعتبر شرط من شروط التسليم، ويقر
              الطرف الثاني بعلمه وموافقته وقبوله على أن يقوم الطرف الأول بتحديد
              شكل وطبيعة إدارة المشروع ، وتقوم هذه الأدارة بالأشراف وتقديم الخدمات
              اللازمة لمالكي وحدات المشروع وهى صيانة كافة المرافق العامة بالمشروع
              (مياه- كهرباء – صرف صحي) وكذا خدمات الأمن والحراسة والرى وإنارة
              المداخل والأسوار وجمع القمامة ونظافة المبنى والمساحات الخضراء وله في
              سبیل ذلك تأسیس شركة لھا شخصیتھا الاعتباریة المستقلة بغرض إدارة
              المشروع ویكون لھذه الشركة الموارد والصالحیات الأداریة والمالیة
              والقانونیة المستقلة لتولي جمیع تلك المسئولیات التي ستمول من حصيلة
              عائد وديعة الصيانة الخاصة بالوحدة المباعة. وتعتبر ھذه النسبة
              المذكورة التزام أساسي في التعاقد لما یترتب على تنفیذه من منفعة عامة
              ومشتركة لجمیع المالك ولا یجوز للمتعاقد التنصل منه باعتباره مقررا
              لصالحه ولصالح باقي المالك، ویعتبر الأخلال به إخلالا أساسیا بشروط ھذا
              العقد.
            </li>
            <li>
              يلتزم الطرف الثاني من تاريخ التسليم الفعلي او الحكمي للوحدة المباعة
              بأن يسدد وفورا ما قد يستحق عليه من فروق ناتجة عن الفرق بين عوائد
              وديعة الصيانة وما هو مستحق عليه فعال نتيجة للحساب الختامي الربع سنوى
              الفعلي لكافة مصاريف الصيانة و الذى سوف يتم إعداده بمعرفة مراقب
              الحسابات الذى تعينه الشركة لهذا الغرض و يتم إخطار الطرف الثاني بهذه
              الفروق لسرعة سدادها وفى حالة تخلف أو امتناع الطرف الثاني عن سداد تلك
              الفروق المالية المستحقة في ذمته يتم حبس ووقف كافة إلتزامات الصيانة
              نحو المتوقف عن السداد ومن حق الطرف الأول حرمانه من كافة الخدمات و
              المرافق أو بعضها كالحرمان من استعمال المصاعد و الكهرباء و المياه على
              أساس أن هذا الحرمان راجعا لفعله وخارج عن ارادة الطرف الأول
            </li>
            <li>
              بمجرد إخطار الطرف الثاني بما يستحق عليه من فروق الصيانة حسب الوارد
              بالمركز المالي المعد بمعرفة المحاسب القانوني يلتزم خلال شهر على
              الأكثر بسداد المبلغ محل الأخطار وفى حالة التأخير يستحق عليه غرامة
              تأخير قدرها %5 شهريا من المبلغ المستحق لحين تمام السداد ومن المتفق
              علیه أن المركز المالي المعد بمعرفة مراقب الحسابات المختص بھذا الشأن
              ھو تقریر محاید یلتزم به طرفا ھذا العقد
            </li>
            <li>
              يلتزم الطرف الثاني بموجب توقيعه على هذا العقد بتنازله الغير قابل
              للرجوع فيه عن حقه في المساهمة او الأشتراك او تسجيل اتحاد شاغلين على
              ان تقوم شركه متخصصة يعينها الطرف الأول منفردا بمسؤوليه ادارة وصيانة
              وامن ونظافة المشروع تكون لها الأختصاصات المقررة إلتحاد الشاغلين وفقا
              لأحكام القانون رقم 119 لسنه 2008 بإصدار قانون البناء والئحته
              التنفيذية.
            </li>
            <li>
              يقر الطرف الثاني بموافقته من اﻵن على تحويل عائد الوديعة المسددة منه
              والخاصة بالصيانة والحراسة والنظافة إلى شركة الأدارة التي ستتولى
              مستقبلاً إدارة وصيانة وحراسة المشروع وتنشأ العالقة القانونية
              المباشرة بين الطرف الثاني وشركة الأدارة في هذا الشأن.
            </li>
            <li>
              كما یلتزم المشترى بدفع نصیبه في مصروفات وتكالیف الأحلال والتجدید
              للمرافق العامة والأجھزة والأدوات واﻵالت المخصصة للصیانة والأمن
              والنظافة طبقا ًلمیزانیة تلك الأعمال والمعتمدة من مراقب الحسابات.
            </li>
            <li>
              يقر الطرف الثاني بإخطار شركة الأدارة في حالة رغبته في إيجار الوحدة
              واستيفاء كافة بيانات المستأجر للشركة كما يقر الطرف الثاني في حالة الوحدات التجارية بعدم تشغيل أي نشاط
                بدون أخذ موافقة الطرف األول الخطية على نوع النشاط التجاري
                وطبيعته.
            </li>
            <li>
              يقر الطرف الثاني بقبوله النهائي وغير المشروط وغير قابل للرجوع فيه او
              الألغاء بحق الطرف الأول في احاله حقوقه والتزاماته المرتبطة بإدارة
              المشروع و صيانه المرافق العامة الي المحال اليه وانه بمجرد اخطار
              الطرف الثاني بهذه الحوالة تنتقل التزامات الطرف الأول المحددة بهذا
              البند وما يترتب عليها من اثار الي المحال اليه وتصبح العالقة بين
              الطرف الثاني والمحال اليه عالقة مباشرة فورا كما يقر الطرف الثاني
              بالتزامه بقبول تعليمات الطرف الأول او من يحال اليه مهمه القيام
              بأعمال الأدارة والصيانة والتي من شانها المحافظة علي الطابع المتميز
              للمشروع.
            </li>
          </ul>
        </div>
      </div>

      <div class="page page-break">
        <div class="section mb-3 lh-30">
          <p class="text-center">
            <span class="fw-bold">البند السابع – </span> الإخلال بالتعاقد وبالسداد
            والفسخ والغرامات والشرط الجزائي
          </p>
          <p>
            في حالة اخلال الطرف الثاني ببنود التعاقد أو تأخر الطرف الثاني أو
            امتناعه عن الوفاء بأي من دفعات باقي الثمن المستحق عليه وكذا قيمة وديعة
            الصيانة أو آي من الألتزامات المالية المستحقة للطرف الأول والمبينة
            بالجدول الملحق بهذا العقد في المواعيد المحددة لها ألى سبب كان سوآءا
            كان السبب راجعا إلـي تقاعسـه أو نتيجة عدم وجود رصيد بحسابه لدي البنك
            او لصدور أمر منه للبنك بوقف صرف الشيكات كلها أو بعضها فانه يحل سداد
            باقي الأقساط المتأخرة فورا بحيث يلتزم الطرف الثاني بالوفاء بها جميعا
            دفعة واحدة مع أحقية الطرف الأول في تحصيل غرامة تأخير قدرها %5 شهريا من
            قيمة كل قسط مستحق تحسب من تاريخ الأستحقاق حتى تاريخ السداد ويقر الطرف
            الثاني بأن هذه الغرامة ارتضاها وانه ملتزم بها كتعويض اتفاقي، كما انه
            تم الأتفاق على انه في حالة ارتداد أي شيك بنكي يضاف غرامة ارتداد قيمتها
            %2 من قيمة الشيك المرتد ويعتبـر العقـد مفسـوخًا مـن تلقـاء نفسـه بـدون
            الحاجـة إلى تنبيه أو إنذار او استصدار حكم قضائي او اتخاذ أي اجراء
            قضائي و بالتالي يعتبر البيع موضوع هذا العقد كأن لم يكن وفي هذه الحالـة
            يحـق للطـرف الأول التصرف في الوحدة المباعة بكافة انواع التصرفات
            المقررة قانونا للمالك في ملكه مع التـزام الطـرف الأول بعـد تصـرفه
            بـالبيع فـي الوحـدة المـذكورة بـان يرد للطرف الثاني المبالغ التي سبق
            ان سددها الأخير له مستقطعا منها ما يعادل 15 % (خمسة عشرة في المائة) من
            اجمالي ثمن الوحـدة كمقابـل المصـروفات الأدارية و كتعويض اتفاقي غير
            خاضعا لرقابة القضاء دون أي اعتراض من الطرف الثاني ومن المتفق عليه ان
            قبول الطرف الأول للوفاء المتأخر من الطرف الثاني لبعض الاقساط او اجزاء
            منها لا يمنعه من التمسك بكافة الجزاءات المشار اليهـا في هذا البند
            ومنها فسخ العقد ولا يعتبر عدم تمسك الطرف الأول بالفسخ او بغرامة
            التأخير بالنسبة لأي قسط من اقساط الثمن تنازال منه عـن التمسـك بهمـا
            بالنسبة لأي من الأقساط وفى جميع الأحوال تضاف مدة التأخير الى مدة
            التسليم فـي حالـة تـأخر الطـرف الثـاني عـن سـداد الأقسـاط المسـتحقة
            عليـة بعـد إسـتالمه للوحـدة تسـري عليـة ايضـا أحكـام هـذا البنـد
            بالأضـافة الـى اقـراره اعـادة حيـازة الوحـدة المباعـة– بالتراضـي –
            وتسـليمها للطـرف الأول خـلال شـهر مـن تـاريخ إخطـارة بـذلك بعـد ان
            اصـبحت يـد الطـرف الثـاني عليهـا بعـد فسـخ العقـد يـدا غاصبة بلا سند
            من القـانون مع التزام الطرف الثاني في هذه الحالة بان يدفع للطـرف الأول
            مبلــغ و قـدره %1 (واحـد فـي المائـة) شـهريا مـن اجمـالي ثمـن الوحدة
            مقابل الأنتفاع عن كل شهر كانت الوحدة في حيازة الطرف الثاني وهذا
            التعويض نهائي وليست ألى جهة قضائية رقابة عليـه و يحـق للطـرف الأول خصم
            هذه المبالغ من المبلغ الملتزم برده للطرف الثاني نتيجة فسخ العقد و ذلك
            دون الحاجة الى اخذ اي إجراءات قانونية ويكون للطرف الأول أن يطلب من
            القضاء المستعجل الحكم بطرده من الوحدة المبيعة ويحق للطرف الأول فى جميع
            الأحوال خصم %15 (خمسة عشره بالمائة) من إجمالى ثمن الوحدة ، كمصاريف
            إدارية وتعويض إتفاقى مقرر لصالح الطرف الأول ولا يخضع لرقابة القضاء
            ويكون إسترداد باقى الثمن على أقساط آجلة وبذات الطريقة التى تم السداد
            بها وعلى أن يبدأ الأسترداد بعد بيع وتصرف الطرف الأول في الوحدة موضوع
            التعاقد وبمعرفة الطرف الأول مع خصم الغرامات والشرط الجزائي
          </p>
          <p>
            كما يحظر علي الطرف الثاني حبس اي قسط او الاحتجاج بعدم السداد ضد الطرف
            الاول لأي سبب كان وإلا يعد الطرف الثاني مخآل إخالآل جوهريآ بالتزاماته
            التعاقدية تجيز للطرف الاول اعمال احكام الفسخ التلقائي لتحقيق الشرط
            الفاسخ الصريح (تعمد الامتناع عن السداد) . اتفق الطرفان انه في حالة
            قيام الطرف الثاني بالتشهير أو تعمد إساءة سمعة الطرف الاول او اي من
            الشركات التابعة له سواء عن طريق استخدام اي وسيلة اعالمية او اي موقع أو
            أي من وسائل التواصل الاجتماعي سواء كانت هذه المعلومات صحيحة او غير
            صحيحة في هذه الحالة يحق للطرف الأول فسخ العقد دون حاجه الى تنبيه او
            انذار او صدور حكم قضائى بالفسخ كما يحق للطرف الأول الرجوع على الطرف
            الثاني بالتعويض المناسب الذي يحدده.
          </p>
        </div>
      </div>

      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند الثامن – </span> العدول عن عقد البيع و
            التصرف في الوحدة
          </p>
          <p>
            في حالة رغبة الطرف الثاني في العدول عن إتمام البيع وفسخ العقد واسترداد
            ما سبق سداده من أقساط فعليه التقــدم بطلب إلى الطرف الأول ويتم البت في
            هذا الطلب خلال مدة أقصاها ثالثون يوما، يقـوم الطـرف الأول بـرد
            المبـالغ المدفوعـة للطـرف الثـاني وفي حالة موافقة الطــرف الأول على
            إتمام العـدول عـن البيـع مخصـوما منهـا مبلـغ يعـادل نسـبة قــدرها %15
            (خمسة عشـرة فـي المائـة) مـن القيمـة الأجماليـة للوحـدة المباعـة وذلـك
            كتعـويض للطـرف الأول عـن الأضرار التي لحقت بة من جراء عدم إتمام البيع
            وهذا التعويض اتفـاقي ارتضـاه الطـرفين وليسـت ألى جهـة قضـائية رقابـة
            عليـه ويقـر الطـرف الثـاني بموافقته على قيام الطرف الأول بخصم هذه
            النسبة من قيمـة الوحـدة والبـدء خـلال 90 يـوم فـي رد بـاقي المبلـغ
            علـى أقسـاط بـنفس الطريقـة التـي تـم بهـا سـداد هـذه الأقسـاط ويحـتفظ
            الطـرف الأول بحقه فـي عـدم الموافقة على العدول عن إتمام البيع وفسخ
            العقد إلا بعد بيع الوحدة موضوع التعامل للغير وقبض ثمنها بالكامل. أما
            في حالة رغبة الطرف الأول العدول عن إتمام فيلتزم الطرف الأول برد كافة
            مدفوعات الطرف الثاني مضاف اليها مبلـغ يعـادل نسـبة قــدرها %15 (خمسة
            عشـرة فـي المائـة) مـن إجمالي المسدد حتى تاريخه على سبيل التعويض وفي
            هذه الحالة يقر الطرف الثاني بأن ليس له أي مطالبات أو تعويضات أخرى
            مستقبلية كما أنه من المتفق عليه صراحة بين الطرفين أن ملكية الوحدة محل
            عقد البيع تظـل مملوكـة للطـرف الأول حتـى سـداد إجمـالي الـثمن المتفـق
            عليـه و لا يحـق للطـرف الثاني ان يطالب باتخاذ اجراءات نقل الملكية قبل
            ذلك كما لا يحق له التنازل عن هذا العقد او حوالته كليا او جزئيا او
            ترتيب أي حقوق عينيـة او شخصـيه قبل تمام السداد و بعـد اسـتالم مخالصـة
            نهائيـة بسـداد كامـل الـثمن مـن الطـرف الأول والا فـإن هـذا التصـرف
            يعد بيعـا لـملك الغيـر ولا ينفـذ فـي حـق الطـرف الأول ولا يحل محل
            الطرف الثاني في هذا العقد سوى ورثته إذا ما التزموا بكامل ما عليه من
            التزامات ويسرى ذات الحكم في حالة فقدان الأهلية أو إفالسه أو إعساره. فى
            حالة رغبة الطرف الثانى القيام باجراءات تعديل فى المستندات الخاصة
            بالوحدة سواء كان ذلك باضافة (بيانات جديـدة تغييـر اسـم المالـك أو
            بياناتـه أو سحب الشيكات المودعة واستبدالها بأخرى سواء على ذات الحساب
            أو حساب آخر) أو احالة الألتزامات التعاقديـة الملقـاة علـى عاتقـه
            بموجـب هـذا العقـد الى شخص جديد يحل محله فى هـذه الألتزامـات أو فـى
            الوحـدة ذاتهـا فانـه يلتـزم بـدفع نسـبة قــــدرها %5 خمسة فـي المائـة
            مـن القيمـة الأجماليـة للوحـدة المباعة كرسوم ادارية نظير ذلك ، شريطة
            موافقة الطرف الأول على هذه التعديالت. ويعفى الطرف الثاني من المصروفات
            الأدارية في حالة نقل الملكية لأي من أقاربة من الدرجة الأولى فقط مع عمل
            اقرار ضامن للشيكات البنكية المسلمة.
          </p>
        </div>
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند التاسع – </span> ملكية أرض المشروع
          </p>
          ${reservation.unit.project.land_owner_section}
        </div>
      </div>

      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند العاشر – </span> مسؤولية الطرف الثاني بعد
            التسليم
          </p>
          <p>يقر الطرف الثاني وخلفة العام أو الخاص بانة يلتزم بما يلي:</p>
          <ul>
            <li>
              يقتصر إنتفاعة بالوحدة على ${
                project_type[reservation.unit.project.type]
              } فقط ولا يجوز له إستعمال الوحدة في
              أي غرض غير ${
                project_type[reservation.unit.project.type]
              } وبما لا يخالف رخصة المباني
            </li>
            <li>
              عدم إستعمال الوحدة في اغراض مخلة لآلداب العامة أو في أي عمل غير
              قانوني او يخل بالأمن العام أو كمخزن أو مستودع لأي مواد وخاصة المواد
              قابلة الاشتعال أو الأنفجار مما يعرض سالمة المشروع والسكان للخطر أو
              البيئة للتلوث
            </li>
            <li>
              عدم إحداث ضوضاء او أزعاج لمالك الوحدات المجاورة و الأمتثال العام
              للوائح وضوابط الطرف الأول أو شركة الأدارة ومواعيد العملة ودخول وخروج
              العمال في حالة قيامة بتنفيذ أى أعمال أو تركيبات بالوحدة المبيعة محل
              هذا العقد
            </li>
            <li>
              عدم تعليق الغسيل بالبلكونات أو التراسات أو في أي أماكن ظاهرة الا
              الأماكن المخصصة لذلك . وكذلك عدم تخزين اية مهمات في تراسات أو
              بلكونات وعدم تغيير أماكن الحمامات والمطابخ والتواليتات أو تغير أو
              دهانات الواجهات والممرات
            </li>
            <li>
              اتباع اللوائح والنظم والتعلیمات التي تضعھا شركة الأدارة في سبیل
              المحافظة على مظھر المبنى وجماله وسالمة المالك والمحافظة التامة على
              سالمة المرافق بحیث تظل دائما صالحة الاستعمال الأمثل.
            </li>
            <li>
              يقر الطرف الثاني بعلمه بأنه من الممكن عند استالم الوحدة الا تكون
              المناطق والمرافق المشتركة والوحدات الأخرى في المشروع قد اكتملت بعد،
              وأنه من الممكن أن يكون هناك اعمال بناء يتم إجراؤها في الوحدات
              والمبانى الأخرى بالمشروع، و أنه لا يحق له الاعتراض أو إقامة أى شكوى
              أو دعوى ضد الطرف الأول بسبب ذلك.
            </li>
            <li>
              يلتزم الطرف الثاني بعدم وضع الفتات أو إعالنات تجارية من أي نوع كانت
              على الواجهات الخارجية للوحدة أو أي من ملحقاتها وعدم تخزين أية مهمالت
              في تراسات أو بلكونات الوحدة أو وضع التاندات أو البرجوالت أو تغيير
              شكل أو تصميم التراسات أو البلكونات سواء بالأضافة أو التعديل أو بوضع
              واجهات زجاجية أو خشبية أو ألوميتال عليها.
            </li>
            <li>
              يلتزم الطرف الثاني بعدم استخدام أية أجهزة أو معدات أو مركبات تحدث
              ضوضاء أو تسبب إزعاجا لمالك الوحدات المجاورة أو تعرض حياتهم أو
              أموالهم للخطر وإتباع أخالقيات الجيرة الحسنة والتصرف بما يتوافق مع
              العادات والتقاليد واستخدام الوحدة المبيعة بطريقة لا تخالف النظام
              والأخالقيات العامة.
            </li>
            <li>
              من المعلوم للطرف الثاني أن الطرف الأول سيقوم بتحديد الأماكن المخصصة
              ألجهزة التكييف بالمباني، وأماكن أطباق استقبال محطات الأقمار الصناعية
              وأماكن مرور الوصالت المختلفة بالوحدات، ويلتزم الطرف الثاني بعدم
              تغيير أماكن أي مما ذكر، حفاظا على الطابع العام والنسق المعماري
              للوحدة والمشروع.
            </li>
            <li>
              عدم وضع أي تركيبات على واجهة الوحدة التي يمتلكها كما لا يجوز ان يضع
              أي تركيبات أو عوائق أو تخزين أي مهمات بمدخل المبنى أو الأفنية أو
              الأسطح أو الممرات أو البدرومات أو الدهاليز المخصصة لإلنتفاع المشترك
            </li>
            <li>
              يلتزم الطرف الثاني بعدم قطع أو إتالف الأشجار بغض النظر عن حجمها أو
              نوعها أو التدخل في أعمال الزراعة الخاصة بالمشروع ويلتزم بعدم زراعة
              أي أشجار أو زراعات عشوائية بالمناطق الخضراء المشتركة حتى لو كانت هذه
              المناطق أمام الوحدة المباعة وتتم زراعة هذه المناطق من قبل الطرف
              الأول فقط .
            </li>
            <li>
              يلتزم الطرف الثاني بعدم التخلص من القمامة والمخلفات إلا في الأماكن
              المخصصة لذلك وفقا لقرارات شركة الأدارة كما یلتزم الطرف الثاني بوضع
              اللافتات الخاصة بالوحدة الخاصة به طبقا للرسومات الھندسیة المعدة من
              الطرف الأول
            </li>
            <li>
              يلتزم الطرف الثانى بالحفاظ على الأرصفة أمام العين وعدم إجراء أى
              تعديالت عليها أو زراعة أجزاء منها أو أستغلالها فى أى غرض ، كما يتعهد
              بالحفاظ على الشوارع والمرافق العامة المخصصة لخدمة المشروع وعدم إجراء
              أية أعمال حفر بها أو عمل مطبات صناعية او القاء مخلفات أو خالفه
            </li>
            <li>
              لا يجوز للطرف الثاني أن يستعمل المرافق المشتركة إلا فيما اعدت له،
              كما لا يجوز أن يحول انتفاعه او استعماله لها دون استعمال وانتفاع باقي
              الشركاء ولا يجوز له احداث أي تعديالت في الأجزاء المشتركة
            </li>
            <li>
              لا یجوز للطرف الثاني ان یضع أي تركیبات من أي نوع على واجھة الوحدة
              التي یمتلكھا دون موافقة الطرف الأول كما لا یجوز ان یضع أي تركیبات أو
              عوائق بمدخل المبنى أو الأفنیة أو الأسطح أو الممرات أو البدرومات أو
              الدھالیز المخصصة لالنتفاع المشترك والالتزام برفعھا فورا على نفقته
              الخاصة مع عدم الاخلال بحق المنتفعین في التعویضات.
            </li>
            <li>
              عدم إحداث أية تعديالت على الوحدة من الداخل أو الخارج بما يؤثر على
              سالمة المبنى أو مبنى جيرانة كما يلتزم بعدم إجراء أي تعديالت على
              التصميم الداخلى للوحدة ألا بعد موافقة الطرف الأول أو من ينوب عنه في
              إدارة المشروع
            </li>
            <li>
              عدم إجراء أية تعديالت أو تغييرات على الو اجهات الخارجية سواء بتغيير
              لون الواجهات او تغيير مواد تشطيب الواجهات أو تعديل الشبابيك أو
              البلكونات أوالتراسات أومقاسات الفتحات بالواجهات سواء بالزيادة أو
              بالنقصان او استحداث فتحات جديدة بالواجهات او إغالق الفتحات الموجودة
              أوتغيير شكل اومادة شبابيك وأبواب وكوبستة البلكونات أو حليات الواجهات
              أو أي تغيير من اي نوع
            </li>
          </ul>
        </div>
      </div>

      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">تابع: البند العاشر – </span> مسؤولية الطرف
            الثاني بعد التسليم
          </p>
          <ul>
            <li>
              اتباع اللوائح والتعليمات التي تضعها شركة الأدارة في سبيل المحافظة
              على مظهر المبنى وجماله وسالمة المالك. أنـه إذا أخـل بـأي التزام مـن
              الألتزامـات الموضـحة بهـذا البنـد يحـق للطـرف الأول أن يقـوم فـورا
              بـدون الحاجـة إلـى تنبيه أو انذار أو إعذار بإزالـة مـا ارتكبـه
              الطـرف الثـاني مـن مخالفـات علـى نفقـة الطـرف الثـاني الـذي يلتـزم
              بـدفع تكـاليف ذلـك مهمـا بلغـت خـلال شـهر علـى الأكثر من إخطارة وفى
              حالة التأخير يستحق عليه غرامة تأخير قدرها %3 شهريا من المبلغ المستحق
              لحين تمام السداد. وفي حالة امتناع الطرف الثـاني عن الدفع لمدة تزيد
              عـن 60 يومـا يقر الطرف الثاني بأن اخلاله بأي مما ذكر أعاله يعتبر
              بمثابة إخلال بالتعاقد ويحق للطرف الأول فسخ التعاقد ويـتم وقـف كافـة
              التزامـات الصـيانة نحـو الطـرف الثـاني ومـن حـق الشـركة حرمانـه مـن
              كافـة الخـدمات والمرافـق أو بعضـها كالحرمان من استعمال المصاعد
              والكهرباء والمياه على أساس أن هذا الحرمان راجعا لفعله وخارج عن إرادة
              الطرف الأول.
            </li>
            <li>
              یلتزم الطرف الثاني بتشطیب الوحدة المباعة محل التعاقد والالتزام
              بالشكل العام للمشروع مع الالتزام بكافة التعلیمات الخاصة بإدارة
              المشروع من حیث تشوین مواد البناء والتشطیب ومواعید دخولھا ودخول
              العمال والالتزام بســــــــــــداد أي تعویضات تنشأ عن أي مخالفات
              تصدر من العمال أو المشرفین المختصین بھذه التشطیبات والالتزام
              بمواعـــــــید العمــــل
            </li>
            <li>
              یلتزم الطرف الثاني بإستصدار جميع التصاريح والموافقات الالزمة (رخصة
              تشغیل ،رخصة نشاط، سندرة، ............الخ ) وعلى نفقته وفي حالة عدم
              التزام الطرف الثاني بذلك وفرض غرامات عليه نتيجة عدم التزامه لإستخراج
              التصاريح والموافقات يلتزم بها الطرف الثاني وحده دون ادني مسئولية علي
              الطرف الأول كما يلتزم بإستخراج وإستصدار جمیع الموافقات اللازمة من
              جمیع الجھات الحكومیة والغــــــیر الحكومیة وموافقة الدفاع المدني دون
              أدنى مسئولیة تقع على عاتق الطرف الاول وإذا أخل بذلك یحق للــــطرف
              الاول الرجوع على الطرف الثاني بكافة التعویضات الالزمة والتي یراھا
              الطرف الاول في ھذا الشأن.
            </li>
            <li>
              یقر الطرف الثاني أنه إذا أخل بأي التزام من الالتزامات الموضحة بھذا
              البند یحق للطرف الأول أن یقوم فورًا بدون الحاجة إلى تنبیه أو انذار
              أو إعذار بإزالة ما ارتكبه الطرف الثاني من مخالفات على نفقة الطرف
              الثاني الذي یلتزم فضلا عن ھذا بإعادة الحالة إلى ما كانت علیه ویدفع
              تكالیف ذلك مھما بلغت وفى حالة عدم ازالة المخالفة یحق للطرف الأول
              التمسك باعتبار ھذا العقد مفسوخا من تلقاء نفسه دون الحاجة إلى تنبیه
              أو إنذار.
            </li>
            <li>
              لا يجوز للطرف الثاني ان يطلب قسمة الأجزاء المشتركة والمرافق المخصصة
              لمنافع الوحدات جميعها كما وأنه ليس له الحق قانونا فيها بالبيع أو بأي
              نوع آخر من أنواع التصرف او الأستغلال مستقلاً عن الوحدة التي يمتلكها
              في المبنى بموجب هذا العقد
            </li>
            <li>
              لا يحق للطرف الثانى إستخدام أو التعدي على مواقع إنتظار في الجراج غير
              المخصصة له (ان وجدت) كما يلتزم بعدم إجراء أي تعديالت أو تعديل
              تشطيبات مكان إنتظار السيارة و عدم إستخدامها في غير الغرض المخصص.
            </li>
          </ul>
        </div>
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند الحادي عشر – </span> مسؤولية الطرف
            الانتفاع بالوحدة والأجزاء المشتركة وسطح العقار
          </p>
          <p>
            یلتزم الطرف الثاني المشتري من اﻵن وبصفة نھائیة أن یقتصر انتفاع الوحدة
            المباعة وللغرض المعدة له طبقا للبند الثانى بحیث لا یجوز له او لخلفه
            الخاص او العام تغییر ذلك الغرض واستغلاله مستقبلا بأي حال من الأحوال في
            مباشرة أي نشاط اخر أیا كان وبدون تحفظ أو إستثناء وعلیه یلزم في جمیع
            الأحوال حصول الطرف الثاني أو شاغل الوحدة على موافقة الطرف الأول على
            نوع النشاط داخل الوحدة. ویلتزم الطرف الثاني بالأنتھاء من تشطیب وتجھیز
            وفتح الوحدة لإلنتفاع بھا في الغرض الذي تم البیع من أجله خلال مدة
            أقصاھا 12 شهرا من تاریخ الأستالم الفعلي أو الحكمي طبقا لأحكام بنود ھذا
            العقد ويعفى من هذه المهلة في حالة النشاط السكني.
          </p>
          <p>
            كما یلتزم الطرف الثاني بعدم تقسیم الوحدة محل ھذا العقد تحت أي ظرف
            وبدون تحفظ أو إستثناء ولا یجوز له أو لخلفه الخاص أو العام تغییر ذلك
            الا بإذن كتابي من الطرف الأول. كما یقر الطرف الثاني بموافقته غیر
            المشروطة بأنه إذا أخل بأي إلتزام من الألتزامات الموضحة بھذا البند يقوم
            بارجاع الشيء ألصله على نفقته الخاصة بالأضافة لدفع غرامة قدرها مائة ألف
            جنيهًا مصريًا بدون الحاجة إلى تنبیه أو إنذار او استصدار حكم قضائي او
            اتخاذ أي اجراء قضائي وأنه ارتضى الغرامة المذكورة بعاليه نتيجة الأخلال.
          </p>
          <p>
            يقر الطرف الثاني ان ملكية الأجزاء المشتركة والسطح والبدروم هي ملكية
            خالصة للطرف الأول أو المتعاقدين عليه وأيضا ما يعلو السطح في حال
            التعلية و استكمال المباني وله فقـط دون غيـره والطرف الأول له حق التصرف
            في السطح وما يعلو من سطح كتصرف المالك في ملكهم وهو ملكية خاصة للطرف
            الأول يحق له التصرف فيه واستغلاله بكافة التصرفات القانونية والتعاقدية
            وأيضًا الممرات أو الحديقة الأمامية والخلفية والجانبية.سـواء كـان
            بمعرفتـه أو بواسطة شركة إدارة متخصصة إدارتها أو استغلالها، ولا يجوز
            بأي حال من الأحوال ضم أي جزء من الأجزاء إلى أي وحدة أو شغلها بأي نوع
            من أنواع الأشغالات. مع ضرورة الأخذ في الأعتبار أن حق الدعاية والأعالن
            وعوائدها في كافة الأماكن ذات الملكية الشائعة هو حـق خـالص للطـرف الأول
            أو مـن ينوب عنه فقط.
          </p>
        </div>
      </div>
      <div class="page page-break">
        <div class="section">
          <p class="text-center">
            <span class="fw-bold">البند الثاني عشر – </span> حق الأمتياز
          </p>
          <p>
            من المعلوم لدى الطرف الثاني أن هذا العقد لا يعد ناقلا للملكية إلا بعد
            سداد كامل الثمن وملحقاته ، وتعتبر يد الطرف الثاني على العين يد عارضة
            لحـين إتمـام سـداد كامـل الـثمن فـي المواعيـد المحـددة فـي البنـد
            الثالـث مـن هـذا العقـد ، مـع عـدم الأخلال بمـا ورد بالبنـد الثالـث
            بالعقـد يحـتفظ الطـرف الأول بحـق الأمتياز على الوحدة المباعة وما يدخل
            عليها مـن تحسـينات ومـا يخصـها ومـا يتبعهـا مـن الأرض و الملحقـات
            وذلـك ضـمانا لسـداد بـاقي الـثمن المتفـق عليـة فـي هذا العقد وفوائده
            واي مبالغ اخرى تكون مستحقة على الطرف الثاني
          </p>
        </div>
        <div class="section">
          <p class="text-center">
            <span class="fw-bold">البند الثالث عشر – </span> التنازل عن حق الشفعة
          </p>
          <p>
            لا يحق للطرف الثاني أو خلفه العام أو الخاص مباشرة حقه في الشفعة في
            البيوع التي تتم عن أي وحدة من وحدات المشروع التـي تقـع بهـا الوحـدة
            المباعـة موضوع هذا العقد ويقر الطرف الثاني بتنازله عن هذا الحق ويسرى
            هذا التنازل سواء تم البيع من الطرف الأول أو من المشترين منه أو من
            خلفهم العام أو الخاص
          </p>
        </div>
        <div class="section">
          <p class="text-center">
            <span class="fw-bold"> البند الرابع عشر – </span> الضرائب والرسوم
          </p>
          <p>
            يلتزم الطرف الثاني بسداد كافة الرسوم والضرائب والعوائد والتأمينات
            وفواتير التليفونات والكهرباء والمياه وأية رسوم أو مستحقات للجهات
            الحكومية والرسمية أيا كان نوعها أو سندها تنتج من تاريخ تسلمه الوحدة
            المباعة كما يلتزم الطرف الثانى بسداد كافة الضرائب العقارية وضريبة
            التصرفات العقارية والأموال الأميرية الناشئة عن هذا العقد والتى عساها
            أن تفرض على الوحدة المبيعة وكذلك أية ضريبة أو رسوم تفرضها السلطات
            المختصة مستقبال. شاملة الضرائب اي كان نوعها ويحق للشركة مطالبة الطرف
            الثاني (المشتـري) بقيمة تلك الضريبة وتباعتهــا وفقا لأية مطالبات او
            تعليمات صادرة من مصلحة الضرائب في هذا الصدد وذلك دون اي حق للمشتري في
            الاعتراض ويلتزم بسدادها في موعد غايته 15 يوم من تاريخ مطالبته بها،
            ويعتبر تخلف الطرف الثاني عن سدادها خلال الاجل المحدد له بمثابة اخلال
            بالتزاماته يحق للطرف الاول اعتبار العقد مفسوخا من تلقاء نفسه دون
            الحاجة الي انذار او اعذار اوصدور حكم قضائي بالفسخ.
          </p>
        </div>
        <div class="section">
          <p class="text-center">
            <span class="fw-bold">البند الخامس عشر – </span> ضمان الأعمال
          </p>
          <p>
            یلتزم الطرف الثاني المشترى عند استالم الوحدة المباعة استالم فعلى او
            حكمي ان یقوم بتسلیم شیك لصالح الطرف الأول بقیمة %5 من قيمة الوحدة
            كتأمین لما قد ینشأ من تلفیات او مخالفات او ما شابه ذلك عند قیام الطرف
            الثاني المشترى بإجراء أي تعدیالت أو تشطیبات أو دیكورات داخلیة للوحدة
            المباعة سواء بنفسه او عن طریق الغیر ولا يتم صرفه (الشيك) إلا فى حالة
            وجود مخالفات أو تلفيات على ان یقوم الطرف الأول برد ھذا المبلغ كاملا او
            المتبقي منه وذلك في حالة وجود تلفیات او مخالفات بعد الانتھاء من كافة
            الاعمال الخاصة بالتشطیبات الداخلیة وفى جمیع الاحوال لا یحق للطرف
            الثاني المشترى اجراء أي تعدیالت او تشطیبات او عمل أي فتحات على واجھات
            المبنى الا بعد الرجوع لإلدارة الھندسیة بمقر الطرف الاول واخذ موافقة
            كتابیة من الطرف الأول بذلك.
          </p>
        </div>
        <div class="section">
          <p class="text-center">
            <span class="fw-bold">البند السادس عشر – </span> التسجيل
          </p>
          <p>
            يلتزم الطرف الثاني ووفقا للقوانين المعمول بهـا ويتحمـل الطـرف الثـاني
            وحده وبمعرفته كافة إجراءات تسجيل الوحدة محل هذا العقد أمام الجهات
            المختصة وكافة رسوم ومصروفات التسجيل أو التنازل أمام الجهات المختصة
            بذلك وما يترتب عليها من ضرائب عقارية وخالفه. و يتعهد الطـرف الأول
            بتسـليم الطـرف الثـاني الأوراق والمسـتندات والرسـومات اللازمة إلتمام
            التسجيل أو التنازل ويتعهد بالتوقيع على عقد البيع النهائي وعمل توكيل
            مخصص بالوحدة بالبيع للنفس للطرف الثاني بعد سداد الطرف الثاني لكامل
            الثمن وملحقاته بشرط أن يكون الطرف الثاني مسددا لكامل الثمن وملحقاته
            والمصروفات وكافة مستحقات الطرف الأول
          </p>
        </div>
        <div class="section">
          <p class="text-center">
            <span class="fw-bold">البند السابع عشر – </span> المرافق
          </p>
          <p>
            يقوم الطرف الأول بانهاء كافة اجراءات توصيل مصادر مياه الشرب والصرف
            الصحي والكهرباء مع الاجهزة المختصة. ويلتزم الطرف الثـاني بسـداد نصـيبه
            (ويقدر بمعرفة الطرف الأول) مـن قيمـة تركيـب العدادات والتوصيالت
            المتعاقد عليها مع شركة توزيع الكهرباء و شركة الميـاه و هيئـة الصـرف
            الصـحي و شـركة الخـدمات التكنولوجيـة (ان وجد) الـى الطـرف الأول قبل
            استالمه الوحدة وذلك فيما يخـص الوحـدة محـل التعاقـد وفـي حالـة عـدم
            التزامـه بـذلك يحـق للطـرف الأول الأمتنـاع عـن تسـليم الوحـدة للطـرف
            الثـاني. ولا يتحمـل الطـرف الأول أيـه مسـؤوليه عـن تـأخر الجهـات
            الحكوميـة أو غيـر الحكوميـة فـي إدخـال خـدمات المرافـق إلـى ارض
            المشـروع مثـل الميـاه والكهرباء والصرف الصحي
          </p>
        </div>
        <div class="section">
          <p class="text-center">
            <span class="fw-bold">البند الثامن عشر - </span> حوالة الحقوق
          </p>
          <p>
            يحق للبائع في أي وقت أن يحــول أو يتنازل عن أي حـق من الحقوق الناشئة
            عن هذا الــعقد وخصوصًا الأوراق التجارية الناشئة عنه لــمن يشـاء ولـه
            الحـق في أن يخصمها لدى أي بنك دون التوقف على رضاء الطرف الثاني ويحق
            للطرف الأول التنازل عن أو حوالة كل أوبعض حقوقه الناشئة عن هذا العقد
            للغير ويعتبر توقيع الطرف الثاني علي هذا العقد قبولا منه لهذه الحوالة
          </p>
        </div>
      </div>
      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند التاسع عشر – </span> المراسالت
          </p>
          <p>
            مـن المتفـق عليـه أن العنـوان الموضـح لكـل طـرف بصـدر هـذا العقـد سواء
            عنوان سكني أو بريد الكتروني أو WhatsApp هـو المـوطن القـانوني الصـحيح
            لـه وأن أي مكاتبـات أو مراسـالت أو إعالنـات أو خالفـه ما لم يخطر أي
            الطرفين اﻵخر بتغير العنوان بخطاب موصى عليه بعلم الوصول إلا إعتبـرت
            جميـع المراسـالت التـي تـتم عليه صحيحة ونافذة قانونا صحيحة ومنتجة
            لكافة إثارها القانونية.
          </p>
        </div>
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند العشرون – </span> الملحقات
          </p>
          <p>
            يلحق بهذا العقد ويعتبر جزء لا يتجزأ منه الملحقات اﻵتية الموقعة بين
            الطرفين:
          </p>
          <ul>
            <li>جدول سداد الأقساط</li>
            <li>
              یلتزم الطرف الثاني بتشطیب الوحدة المباعة محل التعاقد والالتزام
              بالشكل العام للمشروع مع الالتزام بكافة التعلیمات الخاصة بإدارة
              المشروع من حیث تشوین مواد البناء والتشطیب ومواعید دخولھا ودخول
              العمال والالتزام بســــــــــــداد أي تعویضات تنشأ عن أي مخالفات
              تصدر من العمال أو المشرفین المختصین بھذه التشطیبات والالتزام
              بمواعـــــــید العمــــل
            </li>
            <li>المستندات القانونية للتخصيص وسندات الملكية</li>
            <li>مسقط أفقي للوحدة المباعة ومكان وحدة الجراج (إن وجد)</li>
            <li>مواصفات التشطيب العامة</li>
            <li>تفويض بالقيام بأعمال إتحاد شاغلين (نسختين بيد الطرف الأول)</li>
            <li>اقرار ضامن/اقرار تحويالت بنكية (ان وجد)</li>
          </ul>
        </div>
        <div class="section mb-3">
          <p class="text-center">
            <span class="fw-bold">البند الواحد والعشرون – </span> الأختصاص القضائي
          </p>
          <p>
            تختص محاكم القاهرة الجديدة الأبتدائية بكافة درجاتها في الفصل في أي
            نزاع ينشأ -لا قدر الله- عن هذا العقد
          </p>
        </div>
        <div class="section mb-3">
          <p class="text-center">
          <span class="fw-bold">البند الثاني والعشرون – </span> نسخ العقد
          </p>
          <p>
            حرر هذا العقد من ثالثة نسخ نسخة بيد الطرف الثاني ونسختين بيد الطرف
            الأول للعمل بموجبها.
          </p>

          <table class="table table-sm table-bordered">
            <tr class="text-center">
              <th>الطرف الأول</th>
              <th>الطرف الثاني</th>
            </tr>
            <tr>
              <th>الأسم:</th>
              <th>
                ${leads.map(() => `<p>الأسم:</p>`)}
              </th>
            </tr>
            <tr>
              <th>التوقيع:</th>
              <th>
                ${leads.map(() => `<p>التوقيع:</p>`)}
              </th>
            </tr>
            <tr>
              <th>التاريخ:</th>
              <th>التاريخ:</th>
            </tr>
            <tr>
              <th>رقم البطاقة:</th>
              <th>
                ${leads.map(() => `<p>رقم البطاقة:</p>`)}
              </th>
            </tr>
          </table>
        </div>
        ${
          customData.additional_section
            ? `
          <div class="section mb-3" >
            <p class="text-center">
            <span class="fw-bold">البند الثالث والعشرون – </span> إضافي
            </p>
            ${customData.additional_section}
          </div>
          `
            : ""
        }

      </div>
      <div class="page page-break">
        <p class="text-center fw-bold header">ملحق رقم (1)</p>
        <p class="text-center fw-bold sub-header">جدول سداد الأقساط</p>

        <table class="table table-sm table-bordered">
          <tr class="text-center">
            <th>قسط</th>
            <th>تاريخ</th>
            <th>المبلغ الإجمالي</th>
          </tr>
          ${getPaymentTableRows(payment_collections)}
        </table>
      </div>
      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center fw-bold">
            <span class="header">ملحق رقم (2):</span>
            المستندات القانونية للتخصيص وسندات الملكية
          </p>
        </div>
      </div>

      ${reservation.unit.layout_images
        .map(
          (img, index, arr) => `
      <div class="page page-break vh-100 d-flex flex-column">
        <div class="section flex-grow-0 mb-3">
          <p class="text-center fw-bold">
            <span class="header">ملحق رقم (3):</span>  المسقط الأفقي للوحدة المباعة (${
              index + 1
            }/${arr.length})
          </p>
        </div>
        <div class="flex-grow-1 d-flex justify-content-center align-items-center">
          <img class="img-fluid-h" src="${img.url}" />
        </div>
      </div>
      `
        )
        .join("\n")}

      <div class="page page-break">
        <div class="section mb-3">
          <p class="text-center fw-bold">
            <span class="header">ملحق رقم (4):</span> مواصفات التشطيب العامة
          </p>
          ${reservation.unit.project.general_finishing_section}
        </div>
      </div>

      <div class="page page-break">
        <div class="section mb-3 lh-30">
          <p class="text-center fw-bold header">ملحق رقم (5):</p>
          <p class="text-center fw-bold mb-3">
            تفويض بالإدارة والقيام بأعمال اتحاد الشاغلين (شركة إدارة وصيانة)
          </p>
          <p>مقدمة لسيادتكم /${delegationSigner.client_name_ar}</p>
          <p>
            مشترى الوحدة السـكنية رقـم ${reservation.unit.serial} الـدور
            ${reservation.unit.floor_number} بالعمـارة رقـم
            ${reservation.unit.building_num} المقامة على قطعه االرض رقم
            ${reservation.unit.project.land_number} بمنطقة ${
    reservation.unit.project.region
  } حي
            ${
              reservation.unit.project.district
                ? reservation.unit.project.district.name
                : ""
            }, ${
    reservation.unit.project.district && reservation.unit.project.district.city
      ? reservation.unit.project.district.city.name
      : ""
  } من شركة
            جبال للتطوير العقارى بموجب عقد البيع الإبتدائى المؤرخ فى
            ${reservation.selling_date} م
          </p>
          <p>
            أفوض أنا الموقع أدناه الشركة المطورة الطرف الأول بنفسها أو شركة
            الادارة و الصيانة التابعة لها بإدارة المشروع وصيانته والقيام بأعمال
            اتحاد الشاغلين المذكورة في القانون رقم 119 لسنة 2008 وطبقًا لقرار رئيس
            مجلس الوزراء رقم 2184 لسنة ،2022 وصيانة المرافق العامة المخصصة لخدمة
            المشروع مثل (الطرق - الحدائق- المساحات الخضراء- مباني – مصاعد - لوائح
            المشروع - أية مرافق أو شبكات أو تركيبات أو وصلات مشتركة أو رئيسية أخرى
            –) وأقر بأن الطرف الأول وحده هو المفوض والمسؤول عن إدارة المشروع و هو
            صاحب الحق في القيام بأعمال الإدارة والصيانة للمشروع ووحداته وتصريف
            كافة شؤونه وإبرام كافة التصرفات وأداء كافة الأعمال اللازمة لذلك،
            ويعتبر توقيعي بمثابة تفويض غير قابل للعدول عنه لصالح الشركة الطرف
            الأول أو من يوكله في ذلك في القيام بالمهام والأعمال المشار إليها و
            تناز ًال نهائيًا عن تكوين إتحاد شاغلين مع مشتري الوحدات بالمشروع كما
            أقر بإلتزامي باللوائح والقواعد وجدول الأعمال التى ستحددها الشركة الطرف
            الأول في سبيل الحفاظ على المشروع
          </p>

          <div class="w-50 ms-auto mt-5">
            <p>الأسم: ${delegationSigner.client_name_ar}</p>
            <p>العنوان: ${delegationSigner.client_address_ar}</p>
            <p>رقم القومى/جوازالسفر: ${
              delegationSigner.client_nationality_id
            }</p>
            <p>التوقيع: <span class="dotted">......................</span></p>
            <p>التاريخ: <span class="dotted">.... / .... / ........</span> م</p>
          </div>
        </div>
      </div>
    </body>
  </html>
  `;
};
